P4/pizzas_api/app/controllers/pedidos_controller.rb

    def index
        if params[:usuario]
          @pedidos = Pedido.where(usuario: params[:usuario])
          logger.info "Cargando pedidos para usuario: #{params[:usuario]}, Total: #{@pedidos.count}"
        else
          @pedidos = Pedido.all
          logger.info "Cargando todos los pedidos, Total: #{@pedidos.count}"
---
SELECT COUNT(*) FROM "pedidos"
SELECT "pedidos".* FROM "pedidos"

    def create
      @pedido = Pedido.new(pedido_params)
      if @pedido.save
---
INSERT INTO "pedidos" ("numero_telefono", "direccion", "tarjeta", "created_at", "updated_at", "usuario") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["numero_telefono", nil], ["direccion", "a"], ["tarjeta", "3"], ["created_at", "2024-05-19 12:26:52.930962"], ["updated_at", "2024-05-19 12:26:52.930962"], ["usuario", "Victor"]]

    def update
      @pedido = Pedido.find(params[:id])
      if @pedido.update(pedido_params)
---
SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "pedidos" SET "numero_telefono" = ?, "direccion" = ?, "updated_at" = ? WHERE "pedidos"."id" = ?  [["numero_telefono", "34343"], ["direccion", "3343"], ["updated_at", "2024-05-20 09:59:23.678454"], ["id", 2]]

    def show
      @pedido = Pedido.find(params[:id])
---
SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def destroy
      pedido = Pedido.find(params[:id])
      if pedido.destroy
---
SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "pedidos" WHERE "pedidos"."id" = ?  [["id", 4]]