P4/pizzas_api/app/controllers/pizzas_controller.rb

    def index
      @pizzas = Pizza.all
      logger.info "Cargando pizzas, Total: #{@pizzas.count}"
---
SELECT "pizzas".* FROM "pizzas"
SELECT COUNT(*) FROM "pizzas"

    def create
      @pizza = Pizza.new(pizza_params)
      if @pizza.save
---
INSERT INTO "pizzas" ("nombre", "tamano", "coste", "pedido_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["nombre", "Pizza Pepperoni"], ["tamano", "Mediano"], ["coste", 9.0], ["pedido_id", 1], ["created_at", "2024-05-19 18:08:42.716881"], ["updated_at", "2024-05-19 18:08:42.716881"]]

    def update
      @pizza = Pizza.find(params[:id])
      if @pizza.update(pizza_params)
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "pizzas" SET "coste" = ?, "updated_at" = ? WHERE "pizzas"."id" = ?  [["coste", 9.0], ["updated_at", "2024-05-22 20:10:01.865549"], ["id", 2]]

    def destroy
      pizza = Pizza.find(params[:id])
      if pizza.destroy
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "pizzas" WHERE "pizzas"."id" = ?  [["id", 6]]

    def show
      @pizza = Pizza.find(params[:id])
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]