P4/pizzas_api/app/controllers/pizza_ingredientes_extra_controller.rb

  def index
    @pizza_ingredientes_extra = PizzaIngredienteExtra.all
    logger.info "Cargando ingredientes extra, Total: #{@pizza_ingredientes_extra.count}"
---
SELECT "pizza_ingrediente_extras".* FROM "pizza_ingrediente_extras"
SELECT COUNT(*) FROM "pizza_ingrediente_extras"

  def show
    @pizza = Pizza.find(params[:id])
    @pizza_ingredientes_extra = PizzaIngredienteExtra.where(pizza_id: @pizza.id)
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "pizza_ingrediente_extras".* FROM "pizza_ingrediente_extras" WHERE "pizza_ingrediente_extras"."pizza_id" = ?  [["pizza_id", 20]]

  def create
    @pizza_ingrediente_extra = PizzaIngredienteExtra.new(pizza_ingrediente_extra_params)

    if @pizza_ingrediente_extra.save
---
INSERT INTO "pizza_ingrediente_extras" ("pizza_id", "created_at", "updated_at", "nombre") VALUES (?, ?, ?, ?) RETURNING "id"  [["pizza_id", 21], ["created_at", "2024-05-21 18:12:08.167798"], ["updated_at", "2024-05-21 18:12:08.167798"], ["nombre", "Aceitunas Extra"]]

  def destroy
    pizza_ingrediente_extra = PizzaIngredienteExtra.find(params[:id])
    if pizza_ingrediente_extra.destroy
---
SELECT "pizza_ingrediente_extras".* FROM "pizza_ingrediente_extras" WHERE "pizza_ingrediente_extras"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "pizza_ingrediente_extras" WHERE "pizza_ingrediente_extras"."id" = ?  [["id", 24]]